{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "finetuning_task": "ner",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-T005",
    "1": "B-T007",
    "2": "B-T017",
    "3": "B-T022",
    "4": "B-T031",
    "5": "B-T033",
    "6": "B-T037",
    "7": "B-T038",
    "8": "B-T058",
    "9": "B-T062",
    "10": "B-T074",
    "11": "B-T082",
    "12": "B-T091",
    "13": "B-T092",
    "14": "B-T097",
    "15": "B-T098",
    "16": "B-T103",
    "17": "B-T168",
    "18": "B-T170",
    "19": "B-T201",
    "20": "B-T204",
    "21": "I-T005",
    "22": "I-T007",
    "23": "I-T017",
    "24": "I-T022",
    "25": "I-T031",
    "26": "I-T033",
    "27": "I-T037",
    "28": "I-T038",
    "29": "I-T058",
    "30": "I-T062",
    "31": "I-T074",
    "32": "I-T082",
    "33": "I-T091",
    "34": "I-T092",
    "35": "I-T097",
    "36": "I-T098",
    "37": "I-T103",
    "38": "I-T168",
    "39": "I-T170",
    "40": "I-T201",
    "41": "I-T204",
    "42": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-T005": 0,
    "B-T007": 1,
    "B-T017": 2,
    "B-T022": 3,
    "B-T031": 4,
    "B-T033": 5,
    "B-T037": 6,
    "B-T038": 7,
    "B-T058": 8,
    "B-T062": 9,
    "B-T074": 10,
    "B-T082": 11,
    "B-T091": 12,
    "B-T092": 13,
    "B-T097": 14,
    "B-T098": 15,
    "B-T103": 16,
    "B-T168": 17,
    "B-T170": 18,
    "B-T201": 19,
    "B-T204": 20,
    "I-T005": 21,
    "I-T007": 22,
    "I-T017": 23,
    "I-T022": 24,
    "I-T031": 25,
    "I-T033": 26,
    "I-T037": 27,
    "I-T038": 28,
    "I-T058": 29,
    "I-T062": 30,
    "I-T074": 31,
    "I-T082": 32,
    "I-T091": 33,
    "I-T092": 34,
    "I-T097": 35,
    "I-T098": 36,
    "I-T103": 37,
    "I-T168": 38,
    "I-T170": 39,
    "I-T201": 40,
    "I-T204": 41,
    "O": 42
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.48.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
